---
type: ElementPhaseStatusFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ElementPhaseStatusFilter

`Autodesk.Revit.DB.ElementPhaseStatusFilter` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementPhaseStatusFilter | — | `` |
| Method | GetPhaseStatuses | 2012 | `public ICollection < ElementOnPhaseStatus > GetPhaseStatuses ()` |
| Method | PassesFilter | — | `` |
| Property | PhaseId | 2012 | `public ElementId PhaseId { get ; }` |